Repository: sheilagomes/wp-trad
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: That email address already has an account.
pt_br: Este endereço de e-mail já tem uma conta.

source: That said, The GDPR puts tighter guidelines and restrictions.
pt_br: O que acontece é que o GDPR requer diretrizes mais firmes e mais restrições.

source: That username is already in use.
pt_br: Este nome de usuário não está disponível.

source: The 1st Freedom
pt_br: A 1ª liberdade

source: The 2nd Freedom
pt_br: A 2ª liberdade

source: The 3rd Freedom
pt_br: A 3ª liberdade

source: The 4th Freedom
pt_br: A 4ª liberdade

source: The Twenty Nineteen repository is a hive of activity, there have been a stack of minor bugs clean up, and some notable additions:
pt_br: O repositório do Twenty Nineteen está a pleno vapor. Uma série de pequenos erros foram corrigidos e foram feitas algumas adições importantes:

source: The pre_render_block and render_block_data filters have been introduced allowing plugins to override block attribute values (#45451, dev note coming soon).
pt_br: Os filtros pre_render_block e render_block_data foram adicionados, permitindo que plugins sobrescrevam o valor dos atributos de um bloco (#45451, nota de desenvolvedor em breve).

source: The Block Editor
pt_br: O editor de blocos

source: The Codex has more information about all of the issues fixed in 4.9.2, if you'd like to learn more.
pt_br: O Codex tem mais informações sobre todos os problemas corrigidos na versão 4.9.2, se desejar saber mais.

source: The Community
pt_br: A comunidade

source: The Cron API has been updated with new functions to assist with returning data and includes new filters for modifying cron storage.
pt_br: A API Cron foi atualizada com novas funções para auxiliar o retorno de dados e inclui novos filtros para modificar o armazenamento do cron.

source: The Cron system can now be more easily replaced with a custom cron handler (#32656).
pt_br: O sistema de agendamento de tarefas (Cron) agora pode ser substituído com mais facilidade por um manipulador personalizado (#32656).

source: The Database API%s, added in WordPress 0.71, provides the correct method for accessing data as named values which are stored in the database layer.
pt_br: A API de banco de dados%s, adicionada no WordPress 0.71, fornece o método correto para acessar, de forma estruturada, os dados que estão armazenados na camada de banco de dados.

source: The Default Theme
pt_br: O tema padrão

source: The Details
pt_br: Os detalhes

source: The GDPR Compliance Team is focusing on four main areas:
pt_br: O foco da equipe está dividido em quatro áreas principais:

source: The GDPR Compliance team is looking for help to test the privacy tools that are currently being developed in core.
pt_br: A Equipe de conformidade com o GDPR está procurando ajuda para testar as ferramentas de privacidade que estão sendo desenvolvidas.

source: The GNU Public License
pt_br: A licença pública GNU

source: The History of WordPress
pt_br: A história do WordPress

source: The Improved Fatal Error Protection
pt_br: A proteção contra erros fatais

source: The Latest Libraries
pt_br: As bibliotecas mais recentes

source: The People
pt_br: As pessoas

source: The REST API has a couple of bug fixes and performance improvements.
pt_br: A API REST teve alguns erros corrigidos e sua performance foi melhorada.

source: The Role of the Hosting Provider in WordPress Security
pt_br: A função do serviço de hospedagem na segurança do WordPress

source: The Squad
pt_br: O esquadrão

source: The Technology
pt_br: A tecnologia

source: The Theme Review Team
pt_br: A Equipe de avaliação de temas

source: The WordPress 5.1 Field Guide has also been published, which goes into the details of the major changes.
pt_br: O Guia do WordPress 5.1 também foi publicado, detalhando as maiores mudanças da versão.

source: The WordPress Mobile Apps
pt_br: Os aplicativos móveis do WordPress

source: The WordPress mobile apps now include an experimental version of a built-in block editor.
pt_br: Os aplicativos móveis do WordPress agora incluem uma versão experimental do editor de blocos.

source: The block editor has been updated to include all of the features and bug fixes from the upcoming Gutenberg 4.2 release.
pt_br: O editor de blocos foi atualizado para incluir todos os recursos e ajustes da versão 4.2 do Gutenberg.

source: The block editor has been updated to match the Gutenberg 4.3 release, the major changes include:
pt_br: O editor de blocos foi atualizado a partir da versão 4.3 do Gutenberg e as maiores mudanças incluem:

source: The block editor has been updated to match the Gutenberg 4.4 release, the major changes include:
pt_br: O editor de blocos foi atualizado a partir da versão 4.4 do Gutenberg e as maiores mudanças incluem:

source: The block editor has had a couple of bugs fixed (#46137).
pt_br: O editor de blocos teve alguns erros corrigidos (#46137).

source: The block editor has received significant performance improvements since WordPress 5.1, shaving 35% off the load time for massive posts, and cutting the keypress time (how responsive it feels when you’re typing) in half!
pt_br: O editor de blocos recebeu importantes melhorias de desempenho desde o WordPress 5.1, diminuindo 35% do tempo de carregamento em posts grandes, e reduzindo pela metade o tempo de resposta ao digitar!

source: The block editor is a big change, but that’s not all.
pt_br: O editor de blocos é uma grande mudança, mas isso não é tudo.

source: The block editor is coming to the mobile apps
pt_br: O editor de blocos está vindo para os aplicativos móveis

source: The block editor is now using this, and you can start using it, too.
pt_br: E como o editor de bloco já está usando essa API, você também já pode começar a usá-la.

source: The block editor isn’t just for websites, either.
pt_br: O editor de blocos náo é só para sites.

source: The block editor is used on over a million sites, we think it’s ready to be used on all WordPress sites.
pt_br: O editor de blocos está sendo usado em mais de um milhão de sites e nós acreditamos que ele está pronto para ser usado em todos os sites WordPress.

source: The block editor now supports your browser’s reduced motion settings.
pt_br: O editor de blocos agora também tem suporte às configurações de redução de movimento do seu navegador.

source: The block editor provides a modern, media-rich editing experience.
pt_br: O editor de blocos fornece uma experiência de edição moderna e rica em mídias.

source: The comment form not appearing when clicking “Reply” on comments loaded via Ajax (#46260).
pt_br: Exibição do formulário de comentários ao clicar em "Responder" em comentários carregados via Ajax (#46260).

source: The editor should feel a little quicker to start, and typing should feel smoother.
pt_br: É possível sentir o editor iniciar mais rápido e a digitação mais natural.

source: The final known PHP 7.3 compatibility issue has been fixed.
pt_br: Os últimos erros conhecidos de compatibilidade com o PHP 7.3 foram corrigidos.

source: The first phase of this project (originally scoped for WordPress 5.1) is now included in WordPress 5.2.
pt_br: A primeira fase deste projeto (originalmente previsto para o WordPress 5.1) agora faz parte do WordPress 5.2.

source: The first phase of this project is included in WordPress 5.1.
pt_br: A primeira fase deste projeto está incluída no WordPress 5.1.

source: The first release candidate for WordPress 5.0 is now available!
pt_br: O primeiro <i>release candidate</i> (versão candidata, em tradução livre) do WordPress 5.0 já está disponível!

source: The first step is awareness and education.
pt_br: O primeiro passo é conscientizar e educar.

source: The focus of this release was fine-tuning the new block editor, and fixing any major bugs or regressions.
pt_br: O foco deste lançamento foram ajustes no editor de blocos e correções de erros significativos e regressões.

source: The focus styling for keyboard navigating through landmarks is clearer and more consistent.
pt_br: O estilo para o elemento ativo na navegação pelo teclado está mais clara e consistente.

source: The freedom to redistribute.
pt_br: A liberdade de redistribuir.

source: The freedom to run the program, for any purpose.
pt_br: A liberdade para executar o programa, para qualquer propósito.

source: The i18n module has been refactored to benefit from significant performance gains.
pt_br: O módulo de i18n (internacionalização) foi refatorado, recebendo ganhos significativos de desempenho.

source: The inability to edit theme and plugin files on Windows based servers.
pt_br: A impossibilidade de editar arquivos de temas e plugins em servidores Windows.

source: The legacy media dialog having incorrect pagination link styling (#41858).
pt_br: Estilo incorreto na paginação da antiga caixa de diálogo de mídias (#41858).

source: The new Gutenberg block editor is now the default post editor!
pt_br: O novo editor de blocos Gutenberg agora será o editor de posts padrão!

source: The new block-based post editor.
pt_br: O novo editor de posts baseado em blocos.

source: The new privacy tools are scheduled for release at the end of April or beginning of May 2018.
pt_br: O lançamento das novas políticas de privacidade está agendado para o final de abril ou começo de maio de 2018.

source: The next section will show you how to do this.
pt_br: A próxima seção explicará como fazer isso.

source: The path here has been very exciting.
pt_br: O histórico até aqui tem sido muito animador.

source: The permissions and current user API%s is a set of functions which will help verify the current user's permissions and authority to perform any task or operation being requested, and can protect further against unauthorized users accessing or performing functions beyond their permitted capabilities.
pt_br: As permissões e a API de usuário atual%s são um conjunto de funções que ajudam a verificar as permissões do usuário atual e a autoridade para executar qualquer tarefa ou operação solicitada, e pode fornecer proteção adicional para acessos de usuários sem permissão ou que estejam executando funções além das permitidas pelas suas capacidades.

source: The position of an attachment placeholder during uploads has been fixed.
pt_br: O posicionamento do espaço reservado para anexos durante o upload foi ajustado.

source: The post URL slug has better labelling and help text.
pt_br: Melhoramos o texto explicativo para o endereço do post.

source: The previous styles on caption shortcodes have been restored.
pt_br: Os estilos anteriores das legendas dos shortcodes foram restaurados.

source: The previous taxonomy-agnostic behavior of get_category_link() and category_description() was restored.
pt_br: O comportamento de get_category_link() e category_description() que não fazia distinção de taxonomia foi restaurado.

source: The previously scheduled 4.9.7 is now referred to as 4.9.8, and will follow the release schedule posted yesterday.
pt_br: Os planos previstos para a versão 4.9.7 agora se aplicam à versão 4.9.8, que seguirá o cronograma de lançamento publicado ontem.

source: The primary focus of this release was performance improvements in the block editor: the cumulated performance gains make it 330% faster for a post with 200 blocks.
pt_br: O principal foco deste lançamento foram melhorias no desempenho do editor de blocos. Os ganhos de desempenho acumulados tornam o editor 330% mais rápido em um post com 200 blocos.

source: The proceeds from these sales help offset the cost of providing free swag (buttons, stickers, etc.) to WordCamps and WordPress meetups around the world.
pt_br: Os lucros destas vendas ajudam a compensar o custo dos brindes (broches, adesivos etc.) distribuídos nos WordCamps e meetups de WordPress por todo o mundo.

source: The recommended PHP version used by the “Update PHP” notice can now be filtered.
pt_br: A versão de PHP recomendada usada pelo aviso "Atualize o PHP" agora pode ser filtrada.

source: The second release candidate for WordPress 5.0 is now available!
pt_br: O segundo <i>release candidate</i> (versão candidata, em tradução livre) do WordPress 5.0 já está disponível!

source: The second release candidate for WordPress 5.1 is now available!
pt_br: O segundo <i>release candidate</i> (versão candidata, em tradução livre) do WordPress 5.1 já está disponível!

source: The team is focusing on creating a comprehensive core policy, plugin guidelines, privacy tools and documentation.
pt_br: A Equipe está se concentrando na criação de uma política abrangente para os arquivos do próprio WordPress, diretrizes para os plugins, ferramentas de privacidade e documentação.

source: The text and code editing blocks will now use the full width of the editor.
pt_br: Os blocos de edição de texto e código agora ocupam toda a largura do editor.

source: The third release candidate for WordPress 5.0 is now available!
pt_br: O terceiro <i>release candidate</i> (versão candidata, em tradução livre) do WordPress 5.0 já está disponível!

source: The treatment of orderby values for post__in, post_parent__in, and post_name__in has been standardized (#38034).
pt_br: O tratamento de valores orderby por post__in, post_parent__in e post_name__in foi padronizado (#38034).

source: The type of request being confirmed is now included in the subject line for all privacy confirmation emails.
pt_br: O tipo de solicitação sendo confirmada agora faz parte do assunto de todos os e-mails de confirmação de privacidade.

source: The uploading indicator for images and galleries has been replaced with a spinner and faded out image.
pt_br: O indicador de envio de imagens e galerias foi substituído por uma imagem que fica girando e depois desaparece.

source: The work in #46130 is showing good progress towards addressing the security concerns, if you’d like to follow development progress on this feature.
pt_br: O trabalho em #46130 está mostrando um bom progresso nas questões de segurança, se você deseja acompanhar o desenvolvimento deste recurso.

source: Their efforts bring WordPress 5.1 fully translated to 34 languages at release time, with more on the way.
pt_br: Seus esforços trazem o WordPress 5.1 completamente traduzido em 34 idiomas na data de lançamento, e vem mais por aí.

source: Theme System
pt_br: Sistema de temas

source: Themes
pt_br: Temas

source: Then you change the world
pt_br: Você consegue mudar o mundo

source: There are 25 new icons for you to use!
pt_br: Você tem 25 ícones novos para usar!

source: There are plenty of free backup plugins available, so if you don’t have a backup solution already – use one of these.
pt_br: Existem plugins grátis de backup disponíveis , então se você ainda não tem uma solução para backups use um destes.

source: There are a couple of steps you should take to mitigate any risk before proceeding:
pt_br: Existem alguns passos que você deve seguir para evitar riscos antes de prosseguir:

source: There are a variety of new speak messages, and existing messages have been tweaked for more useful screen-reader behaviour.
pt_br: Várias novas mensagens faladas foram criadas e as existentes foram modificadas para serem mais úteis no contexto de leitores de tela.

source: There are hundreds of bug fixes and improvements in the block editor, you can read more about them in the Gutenberg plugin releases: 4.9, 5.0, 5.1, 5.2, and 5.3.
pt_br: Existem centenas de correções e melhorias no editor de blocos, você pode ler mais sobre elas nas versões do plugin Gutenberg: 4.9, 5.0, 5.1, 5.2 e 5.3.

source: There are no releases, yet.
pt_br: Ainda não há versões.

source: There are two main benefits to keeping PHP up-to-date:
pt_br: Existem dois benefícios principais em manter o PHP atualizado:

source: There are two ways to test the WordPress 5.0 Beta: try the WordPress Beta Tester plugin (you’ll want “bleeding edge nightlies”), or you can download the beta here (zip).
pt_br: Existem duas formas de testar o WordPress 5.0 beta: com o plugin WordPress Beta Tester (você deve usar “bleeding edge nightlies”) ou você pode baixar a versão aqui (zip).

source: There are two ways to test the WordPress 5.0 beta: try the WordPress Beta Tester plugin (you’ll want “bleeding edge nightlies”), or you can download the beta here (zip).
pt_br: Existem duas formas de testar o WordPress 5.0 beta: com o plugin WordPress Beta Tester (você deve usar “bleeding edge nightlies”) ou você pode baixar a versão aqui (zip).

source: There are two ways to test the WordPress 5.1 beta: try the WordPress Beta Tester plugin (you’ll want to select the “bleeding edge nightlies” option), or you can download the beta here (zip).
pt_br: Existem duas formas de testar o WordPress 5.1 beta: com o plugin WordPress Beta Tester (você deve usar “bleeding edge nightlies”) ou você pode baixar a versão aqui (zip).

source: There are two ways to test the WordPress 5.1 beta: try the WordPress Beta Testerplugin (you’ll want to select the “bleeding edge nightlies” option), or you can download the beta here (zip).
pt_br: Existem duas formas de testar o WordPress 5.1 beta: com o plugin WordPress Beta Tester (você deve usar “bleeding edge nightlies”) ou você pode baixar a versão aqui (zip).

source: There are two ways to test the WordPress 5.1 release candidate: try the WordPress Beta Tester plugin (you’ll want to select the “bleeding edge nightlies” option), or you can download the release candidate here (zip).
pt_br: Existem duas formas de testar o WordPress 5.1 release candidate: com o plugin WordPress Beta Tester (você deve usar “bleeding edge nightlies”) ou você pode baixar a versão aqui (zip).

source: There are two ways to test this WordPress 5.0 Beta: try the WordPress Beta Tester plugin (you’ll want “bleeding edge nightlies”), or you can download the beta here (zip).
pt_br: Existem duas formas de testar o WordPress 5.0 Beta: com o plugin WordPress Beta Tester (você deve usar “bleeding edge nightlies”) ou você pode baixar a versão aqui (zip).

source: There have been 130 tickets closed in WordPress 5.2 so far, with numerous small bug fixes and improvements to help smooth your WordPress experience.
pt_br: Foram fechados 130 tickets no WordPress 5.2 até agora, com várias pequenas correções de erros e melhorias para tornar a sua experiência no WordPress ainda melhor.

source: There have been over 360 tickets closed in WordPress 5.1, with numerous small bug fixes and improvements to help smooth your WordPress experience.
pt_br: Foram mais de 360 tickets fechados no WordPress 5.1, com várias pequenas correções de erros e melhorias para tornar a sua experiência no WordPress ainda melhor.

source: There is a new functionality to confirm user requests by email address.
pt_br: Há uma nova funcionalidade para confirmar solicitações de usuários através do endereço de e-mail.

source: There’s a new release of Dashicons, the WordPress Dashboard icon font.
pt_br: Há uma nova versão dos Dashicons, a fonte de ícones do Painel do WordPress.

source: There’s now a widget area in the page footer.
pt_br: Agora há uma nova área de widgets no rodapé das páginas.

source: These are the reasons you should update PHP today.
pt_br: Essas são as razões pelas quais você deve atualizar o PHP hoje.

source: These benefits are good for you, and good for your website’s visitors.
pt_br: Esses são benefícios para você e para os visitantes do seu site.

source: These websites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including tracing your interaction with the embedded content if you have an account and are logged in to that website.
pt_br: Estes sites podem coletar dados sobre você, usar cookies, incorporar rastreamento adicionar de terceiros e monitorar sua interação com este conteúdo incorporado, incluindo sua interação com o conteúdo incorporado se você tem uma conta e está conectado com o site.

source: They received wonderful assistance from the following 561 contributors for this release, 231 of whom were making their first ever contribution!
pt_br: Eles receberam a maravilhosa ajuda dos seguintes 561 colaboradores desta versão, sendo a primeira contribuição para 231 deles!

source: They should, and popular or reputable ones almost certainly will be, but we can’t guarantee it.
pt_br: Eles deveriam funcionar, os grandes e populares certamente funcionam, mas não podemos garantir isso.

source: They’ll all be able to help out with their areas of expertise.
pt_br: Cada um deles poderá ajudar conforme suas especializações.

source: Things are appearing very stable and we hope to announce a date soon.
pt_br: Tudo parece estável e esperamos anunciar uma data em breve.

source: This “Try Gutenberg” is an opportunity for WordPress users to use the Gutenberg block editor before it is released in WordPress 5.0.
pt_br: Isto servirá como uma oportunidade para que os usuários do WordPress possam usar o editor de blocos Gutenberg antes que ele seja lançado no WordPress 5.0.

source: This cookie includes no personal data and simply indicates the post ID of the article you just edited.
pt_br: Este cookie não inclui nenhum dado pessoal e simplesmente indica o ID do post referente ao artigo que você acabou de editar.

source: This could include technical measures such as encryption; security measures such as two factor authentication; and measures such as staff training in data protection.
pt_br: Isso pode incluir medidas técnicas como encriptação; medidas de segurança como autenticação em dois passos; e medidas como treinamento de pessoal em proteção de dados.

source: This could include your web hosting, cloud storage, or other third party services.
pt_br: Isto pode incluir a sua hospedagem de sites, armazenamento de nuvem ou outros serviços de terceiros.

source: This does not include any data we are obliged to keep for administrative, legal, or security purposes.
pt_br: Isto não inclui nenhuns dados que somos obrigados a manter para propósitos administrativos, legais ou de segurança.

source: This incredible community makes it possible for WordPress to keep growing while still also remaining free.
pt_br: Essa comunidade incrível torna possível manter o crescimento do WordPress, mesmo ele sendo de graça.

source: This is a security and maintenance release for all versions since WordPress 3.7.
pt_br: Essa é uma atualização de segurança e manutenção para todas as versões a partir do WordPress 3.7.

source: This is a security and maintenance release for all versions since WordPress 3.7﻿.
pt_br: Essa é uma atualização de segurança e manutenção para todas as versões a partir do WordPress 3.7.

source: This is a security release for all versions since WordPress 3.7.
pt_br: Essa é uma atualização de segurança para todas as versões a partir do WordPress 3.7.

source: This is a big release and needs your help—if you haven’t tried 5.0 yet, now is the time!
pt_br: Este é um grande lançamento e precisa da sua ajuda. Se você ainda não testou a versão 5.0, a hora é essa!

source: This is an important milestone, as we near the release of WordPress 5.0.
pt_br: Isso é bem importante, significa que estamos cada vez mais próximos do WordPress 5.0.

source: This is an important milestone, as we near the release of WordPress 5.0. The WordPress 5.0 release date has shifted from the 27th to give more time for the RC to be fully tested.
pt_br: Isso é bem importante, significa que estamos cada vez mais próximos do WordPress 5.0. A data de lançamento do WordPress 5.0 foi adiada e não será mais no dia 27, para que o RC seja completamente testado.

source: This is so we can recognize and approve any follow-up comments automatically instead of holding them in a moderation queue.
pt_br: Fazemos isso para que seja possível reconhecer e aprovar automaticamente qualquer comentário posterior ao invés de retê-lo para moderação.
